Documents/ЗаявкаНаОткрытиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаОткрытиеСчета</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭПКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьКонтактногоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаОстаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписаниеВ1СДиректБанк</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтактногоЛицаПодробно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяИнтеграцияССервисомАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Банки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанкиУниверсальногоОбмена</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПродукта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтправлятьСогласие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиПоказателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеОтсутствуют</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиДополнительнойИнформации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиДопИнформации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанкиУниверсальногоОбмена</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоФайл</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиФайла</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеОтсутствуют</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПрисоединенныйФайл</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Валюты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ЗаявкиНаОткрытиеСчетаКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ПодписаниеИОтправка

// Возвращает структуру параметров для отправки заявки на открытие счета (без подписи).
//
// Параметры:
//	СервисОбменаСБанками - ПеречислениеСсылка.СервисыОбменаСБанками - Сервис.
//
// Возвращаемое значение:
//	Структура - см. переменную Результат.
//
Функция ПараметрыПодписанияИОтправки(СервисОбменаСБанками) Экспорт

	Результат = Новый Структура();
	// Входящие параметры, указываются вызывающей процедурой.
	Результат.Вставить("СервисОбменаСБанками", СервисОбменаСБанками);
	Результат.Вставить("ЗаявкаНаОткрытиеСчета", ПредопределенноеЗначение("Документ.ЗаявкаНаОткрытиеСчета.ПустаяСсылка"));
	Результат.Вставить("Организация",    ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
	Результат.Вставить("Банки",          Новый Массив); // Массив из элементов справочника БанкиУниверсальногоОбмена, в которые отправить заявку.
	Результат.Вставить("ПредставленияДополнительныхФайлов", Новый СписокЗначений); // краткие представления дополнительных файлов к заявке.
	Результат.Вставить("ДокументооборотыПолучателей"); // Ключ - банк, значение - документооборот для него.
	// Ссылка на перечисление ТипыТранзакцийОбменаСБанкамиЗаявкиНаОткрытиеСчета.
	Результат.Вставить("ТипТранзакции");

	ПараметрыОтбораСертификата = УниверсальныйОбменСБанкамиФормыКлиентСервер.ПараметрыОтбораСертификата(СервисОбменаСБанками);
	Результат.Вставить("ПараметрыОтбораСертификата", ПараметрыОтбораСертификата);
	
	// Значения, которые доступны только на клиенте (не могут передаваться на сервер).
	Результат.Вставить("ПараметрыНаКлиенте", Новый Структура());
	Результат.ПараметрыНаКлиенте.Вставить("ВладелецФормы");         // Форма-владелец
	Результат.ПараметрыНаКлиенте.Вставить("ОповещениеОЗавершении"); // Оповещение, которое необходимо вызвать после завершения всего процесса (необязательное).
	
	Результат.Вставить("ПараметрыКриптографии", НовыеПараметрыВыбранногоСертификата());
	Результат.Вставить("ТребуетсяЭП", Ложь);

	Возврат Результат;

КонецФункции

// Инициирует процесс подписания и отправки подготовленной заявки на кредит в указанные банки.
// Заявка на кредит должна быть полностью заполненной, в отношении нее должны быть проведены 
// все необходимые проверки заполнения и т.п.
//
// Параметры:
//	ПараметрыПодписанияИОтправки - Структура - см. результат функции ПараметрыПодписанияИОтправки().
// 
Процедура НачатьПодписаниеИОтправку(ПараметрыПодписанияИОтправки) Экспорт

	Если Не ЗначениеЗаполнено(ПараметрыПодписанияИОтправки.ЗаявкаНаОткрытиеСчета) Тогда
		// Нечего или некому отправлять.
		Возврат;
	КонецЕсли;
	
	Если Не ПараметрыПодписанияИОтправки.ТребуетсяЭП Тогда
		
		ОткрытьФормуПодписанияИОтправки(ПараметрыПодписанияИОтправки);
		Возврат;
	
	КонецЕсли;

	// Сначала определим, каким сертификатом будем подписывать заявку.
	//
	// Если это облачный сертификат, то запустим фоновое задание и все действия выполняем на сервере,
	// предварительно прислав пользователю sms-пароль для получения сеансового ключа крипосервиса.
	//
	// Если это локальный сертификат:
	// 	- формируем файлы для заявки и отчетности на сервере;
	// 	- там их сжимаем (в веб-клиенте zip не доступен);
	//	- передаем на клиент исходный файл для подписания и его zip-архив для шифрования;
	//	- после подписания и шифрования передаем назад на сервер файл подписи (отсоединенный) и шифрованный zip-файл,
	//	  которые вкладываются в транспортный контейнер;
	//	- запускаем фоновое задание для отправки сформированных контейнеров в сервис обмена с банками.
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораСертификатаДляПодписи", ЭтотОбъект, ПараметрыПодписанияИОтправки);
	
	// В качестве дополнительных параметров передаем условия для отбора доступных сертификатов.
	ДополнительныеПараметрыКриптографии = УниверсальныйОбменСБанкамиКлиентСервер.НовыеДополнительныеПараметрыКриптографии();
	ДополнительныеПараметрыКриптографии.Сервис          = ПараметрыПодписанияИОтправки.СервисОбменаСБанками;
	ДополнительныеПараметрыКриптографии.Организация     = ПараметрыПодписанияИОтправки.Организация;
	ДополнительныеПараметрыКриптографии.ПараметрыОтбора = ПараметрыПодписанияИОтправки.ПараметрыОтбораСертификата;
	
	УниверсальныйОбменСБанкамиКлиент.ПараметрыКриптографии(ОписаниеОповещения, ДополнительныеПараметрыКриптографии);

КонецПроцедуры

// Инициализирует структуру параметров выбранного сертификата.
// 
Функция НовыеПараметрыВыбранногоСертификата() Экспорт

	ПараметрыВыбранногоСертификата = Новый Структура();
	ПараметрыВыбранногоСертификата.Вставить("Выполнено",                           Ложь);
	ПараметрыВыбранногоСертификата.Вставить("ОтпечатокСертификата",                "");
	ПараметрыВыбранногоСертификата.Вставить("ПарольЗакрытогоКлюча",                "");
	ПараметрыВыбранногоСертификата.Вставить("ЭтоЭлектроннаяПодписьВМоделиСервиса", Ложь);
	
	Возврат ПараметрыВыбранногоСертификата;

КонецФункции

#КонецОбласти

#Область СообщенияПоЗаявкамНаОткрытиеСчета

Процедура ПослеНачалаРаботыСистемы() Экспорт
		
	ПодключитьОбработчикОжидания("Подключаемый_ОповеститьОНовыхСообщенияхПоЗаявкамНаОткрытиеСчета", 15, Истина);
	
КонецПроцедуры    

Процедура ПослеОткрытияЖурналаДеньги() Экспорт
	
	ПодключитьОбработчикОжидания("Подключаемый_ОповеститьОбОткрытииСчета", 15, Истина);     
	ПодключитьОбработчикОжидания("Подключаемый_ОповеститьОНовыхСообщенияхПоЗаявкамНаОткрытиеСчета", 15, Истина);
	
КонецПроцедуры

Процедура ПерезапуститьПроверкуСообщенийОтБанков() Экспорт
	
	// Регл.задание по проверке ответов от банков первый раз запускается через 15 мин,
	// поэтому показ оповещения включим сначала через 20 мин, чтобы рег.задание успело отработать.
	
	ИнтервалВыполненияПроверки = 1200;
	
	ОтключитьОбработчикОжидания("Подключаемый_ОповеститьОНовыхСообщенияхПоЗаявкамНаОткрытиеСчета");
	ПодключитьОбработчикОжидания("Подключаемый_ОповеститьОНовыхСообщенияхПоЗаявкамНаОткрытиеСчета",
		ИнтервалВыполненияПроверки, Истина);
	
	ОтключитьОбработчикОжидания("Подключаемый_ОповеститьОбОткрытииСчета");
	ПодключитьОбработчикОжидания("Подключаемый_ОповеститьОбОткрытииСчета",
		ИнтервалВыполненияПроверки, Истина);

КонецПроцедуры

Процедура ПодключитьИнтернетПоддержкуПользователей() Экспорт

	// Открываем форму подключения ИПП не сразу, а через таймер,
	// чтобы можно было вызывать из другой формы в обработчике ПриОткрытии() с параметром Отказ.
	ПодключитьОбработчикОжидания("Подключаемый_НачатьПодключениеИнтернетПоддержкиИзЗаявкиНаОткрытиеСчета", 0.5, Истина);
	
КонецПроцедуры

Процедура ПослеПодключенияИнтернетПоддержки(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		// Откроем основную форму новой заявки.
		ОткрытьФорму("Документ.ЗаявкаНаОткрытиеСчета.ФормаОбъекта");
	Иначе
		// Пользователь отказался от подключения либо у него не хватило прав.
		ТекстСообщения = НСтр("ru = 'Для отправки заявок необходимо подключение Интернет-поддержки'");
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

// Выводит оповещения пользователю по массиву сообщений
//
// Параметры:
//  НовыеСообщенияОтБанков - Массив	- массив структур, содержащих описание нового состояния заявки на кредит
//										см. РегистрыСведений.СостояниеЗаявокНаОткрытиеСчета.НовыеСообщенияОтБанков()
//
Процедура ОповеститьОНовыхСообщенияхОтБанков(НовыеСообщенияОтБанков) Экспорт 
	
	Для	Каждого ОписаниеСообщения Из НовыеСообщенияОтБанков Цикл
		
		Картинка = БиблиотекаКартинок.СервисПоКредитамОдобрено;
		Пояснение = НСтр("ru='Новое сообщение от сервиса 1С: Заявки на открытие счета'");
		
		Если ОписаниеСообщения.ЕстьОшибки Тогда
			Картинка = БиблиотекаКартинок.ОшибкаОтправки;
			Пояснение = НСтр("ru='Ошибка при обмене данными по заявке'");
		ИначеЕсли ОписаниеСообщения.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияЗаявокНаОткрытиеСчета.Отказано") Тогда 	
			Пояснение = НСтр("ru='Отказ по заявке'");
			Картинка = БиблиотекаКартинок.СервисПоКредитамОтказано;
		ИначеЕсли ОписаниеСообщения.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияЗаявокНаОткрытиеСчета.ОжидаетРешения") Тогда
			Пояснение = НСтр("ru='Подтверждение получения заявки'");
		КонецЕсли;	
				
		ЗначенияКлюча = Новый Структура;
		ЗначенияКлюча.Вставить("ЗаявкаНаОткрытиеСчета", ОписаниеСообщения.ЗаявкаНаОткрытиеСчета);
		ЗначенияКлюча.Вставить("Организация", ОписаниеСообщения.Организация);
		ЗначенияКлюча.Вставить("Банк", ОписаниеСообщения.Банк);
		
		Действие = Новый ОписаниеОповещения("ОткрытьИнформациюПоЗаявке", ЗаявкиНаОткрытиеСчетаКлиент, ЗначенияКлюча);  
		
		ШаблонИдентификатораОповещения = "%1-%2-%3";
		ИдентификаторОповещения = СтрШаблон(
			ШаблонИдентификатораОповещения,
			ОписаниеСообщения.ЗаявкаНаОткрытиеСчета.УникальныйИдентификатор(),
			ОписаниеСообщения.Организация.УникальныйИдентификатор(),
			ОписаниеСообщения.Банк.УникальныйИдентификатор());
		
		ПоказатьОповещениеПользователя(
			ОписаниеСообщения.Банк,
			Действие,
			Пояснение,
			Картинка,
			СтатусОповещенияПользователя.Важное,
			ИдентификаторОповещения);
						
	КонецЦикла;
	
КонецПроцедуры

Процедура ОповеститьОбОткрытииНовыхСчетов(СообщенияОтБанковОбОткрытии) Экспорт 
	
	ИмяФормы = "РегистрСведений.СостояниеЗаявокНаОткрытиеСчета.Форма.ПоказСообщенийОткрытиеСчета";

	Если Не ФормаСообщенийОткрытиеСчетаОткрыта(ИмяФормы) Тогда   
		
	    ПараметрыОткрытияФормы = Новый Структура("СообщенияОтБанков", СообщенияОтБанковОбОткрытии);
		ОткрытьФорму(ИмяФормы, ПараметрыОткрытияФормы);
		
	КонецЕсли;
								
КонецПроцедуры

Процедура ОткрытьИнформациюПоЗаявке(ЗначенияКлюча) Экспорт 
		
	ОткрытьФорму("РегистрСведений.СостояниеЗаявокНаОткрытиеСчета.Форма.ИнформацияПоЗаявкеНаОткрытиеСчета", 
			Новый Структура("Ключ", ЗаявкиНаОткрытиеСчетаВызовСервера.КлючЗаписиСостоянияЗаявки(ЗначенияКлюча))); 
			
КонецПроцедуры

Функция ФормаСообщенийОткрытиеСчетаОткрыта(ИмяФормы)
	
	Окна = ПолучитьОкна();
	
	Если Окна = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Формы = Новый Массив;
	Формы.Добавить(ИмяФормы);
		
	// Для формы, открытой в режиме "РежимОткрытияОкнаФормы.БлокироватьОкноВладельца",
	// не выполняется поиск по уникальному идентификатору, поэтому приходится искать самим.
	Для Каждого ОткрытоеОкно Из Окна Цикл
		Если ТипЗнч(ОткрытоеОкно) = Тип("ОкноКлиентскогоПриложения") 
			И ОткрытоеОкно.Содержимое.Количество() = 1
			И (Формы.Найти(ОткрытоеОкно.Содержимое[0].ИмяФормы) <> Неопределено) Тогда
			
			Возврат ОткрытоеОкно.Содержимое[0].Открыта();
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область ПодписаниеИОтправка

Процедура ПослеВыбораСертификатаДляПодписи(Результат, ПараметрыПодписанияИОтправки) Экспорт

	Если Не ПроверитьРезультатВыполнения(Результат, ПараметрыПодписанияИОтправки) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПодписанияИОтправки.ПараметрыКриптографии = Результат;
	
	Если Результат.ЭтоЭлектроннаяПодписьВМоделиСервиса Тогда
		// Инициализируем сервис криптографии для работы с ЭП в облаке.
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеИнициализацииСервисаКриптографии",
			ЭтотОбъект,
			ПараметрыПодписанияИОтправки);
	
		УниверсальныйОбменСБанкамиКлиент.ИнициализироватьСервисКриптографии(Результат.ОтпечатокСертификата, ОписаниеОповещения);
	Иначе
		ОткрытьФормуПодписанияИОтправки(ПараметрыПодписанияИОтправки);
	КонецЕсли;

КонецПроцедуры

Процедура ПослеИнициализацииСервисаКриптографии(Результат, ПараметрыПодписанияИОтправки) Экспорт

	Если Не ПроверитьРезультатВыполнения(Результат, ПараметрыПодписанияИОтправки) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуПодписанияИОтправки(ПараметрыПодписанияИОтправки);

КонецПроцедуры

Процедура ОткрытьФормуПодписанияИОтправки(ПараметрыОтправки) Экспорт

	ПараметрыФормы = Новый Структура();

	// Передаем в форму все исходные параметры, кроме доступных только на клиенте.
	Для каждого КлючИЗначение Из ПараметрыОтправки Цикл
		Если КлючИЗначение.Ключ <> "ПараметрыНаКлиенте" Тогда
			ПараметрыФормы.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПодписаниеИОтправкаЗавершение", ЭтотОбъект, ПараметрыОтправки);
	
	ОткрытьФорму("Документ.ЗаявкаНаОткрытиеСчета.Форма.ПодписаниеИОтправка",
		ПараметрыФормы,
		ПараметрыОтправки.ПараметрыНаКлиенте.ВладелецФормы,
		, , ,
		ОповещениеОЗавершении);

КонецПроцедуры

Процедура ПодписаниеИОтправкаЗавершение(Результат, ПараметрыОтправки) Экспорт
	Перем Транзакции;
	
	Если Не ПроверитьРезультатВыполнения(Результат, ПараметрыОтправки) Тогда
		Возврат;
	КонецЕсли;
	
	Результат.Свойство("Транзакции", Транзакции);
	ОповеститьОЗавершенииОтправки(Истина, ПараметрыОтправки, Транзакции);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Отправка

Функция ПроверитьРезультатВыполнения(Результат, ПараметрыОтправки)

	Выполнено      = Ложь;
	ОписаниеОшибки = "";

	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Если Результат.Свойство("Выполнено") Тогда
			Выполнено      = Результат.Выполнено;
		КонецЕсли;
		Если Результат.Свойство("ОписаниеОшибки") Тогда
			ОписаниеОшибки = Результат.ОписаниеОшибки;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		// Покажем текст ошибки пользователю.
		ПоказатьПредупреждение(, ОписаниеОшибки);
	КонецЕсли;
	
	Если Не Выполнено Тогда
		ОповеститьОЗавершенииОтправки(Ложь, ПараметрыОтправки);
	КонецЕсли;
	
	Возврат Выполнено;

КонецФункции

Процедура ОповеститьОЗавершенииОтправки(Выполнено, ПараметрыОтправки, Транзакции = Неопределено)
	
	Перем ОповещениеОЗавершении;
	
	Если Не (ЗначениеЗаполнено(ПараметрыОтправки)
		И ПараметрыОтправки.Свойство("ПараметрыНаКлиенте")
		И ПараметрыОтправки.ПараметрыНаКлиенте.Свойство("ОповещениеОЗавершении", ОповещениеОЗавершении)
		И ОповещениеОЗавершении <> Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура();
	Результат.Вставить("Выполнено",  Выполнено);
	Результат.Вставить("Транзакции", Транзакции);
	
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Результат);

КонецПроцедуры

#КонецОбласти

#КонецОбласти
